# Taps
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/bundle"

# CLI tools
brew "git"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tree"
brew "wget"

# Programming languages
brew "node"
brew "python"
brew "go"

# Applications
cask "alacritty"
cask "visual-studio-code"
cask "docker"
cask "firefox"
cask "google-chrome"
